Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེས་ནམ་ནངས་ནས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ལ་སྨྲས་པ། ཤེས་ལྡན་དག་བདག་གིས་རྨི་ལམ་འདི་འདྲ་བ་ཞིག་མཐོང་ངོ་།
en: After the night had passed, Tomara said to the people of the Licchavi clan in Vaiśālī, “Sirs, I dreamed such-and-such a dream.”

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་དེ་ལ་ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: “Sirs, what should we do about it?” they wondered.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕོ་ཉ་སུ་ཞིག་གཏང་ཞེས་ཕན་ཚུན་བགྲོ་བར་བརྩམས་པ་དང་། མདུན་ན་འདོན་མདའ་བོ་ཆེ་འདི་ཉིད་ཐམས་ཅད་དུ་ནུས་པ་ཡིན་ལ། བདག་ཅག་ལ་ཡང་བྱམས་པ་ཡིན་གྱིས་གཏང་ངོ་།
en: “Whom shall we send as a messenger to the Blessed One?” They conferred with each other and said, “This chief priest Tomara is himself capable in everything and he loves us.

source: །དེ་ལ་དེ་དག་གིས་སྨྲས་པ།
en: We shall send him.” They said to him, “Go to the Blessed One.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ལ་ཕྱིན་ནས་བདག་ཅག་གི་ཚིག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱོས་ལ། གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ་ཞེས་བྱ་བ་ནས་སྙུན་གསོལ་ལ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: When you have arrived, bow low on our behalf until your forehead touches the Blessed One’s feet, and then ask if the Blessed One is free from trouble, free from illness . . . .

source: །འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཅིག །བཙུན་པ་ཡངས་པ་ཅན་གྱི་ཚོགས་ཀྱི་མཆིད་ནས་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་དུ་གཤེགས་སུ་གསོལ།
en: Then say, ‘Honored One, this is a message from the people of Vaiśālī: “May the Blessed One come to Vaiśālī.

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་དུ་མ་གཤེགས་ན་རིང་པོར་མི་ཐོགས་པ་ཁོ་ནར་ཡངས་པ་ཅན་སྟོངས་ཤིང་མིང་ལུས་པར་འགྱུར་རོ་ཞེས་གསོལ་ཅིག །དེས་སྨྲས་པ།
en: If the Blessed One does not come to Vaiśālī, Vaiśālī will soon be uninhabited, retaining only its name.’ ”

source: ཤེས་ལྡན་དག་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ནི་ཁྱེད་ལ་ཡུན་རིང་དུ་གནོད་པ་བྱེད་པ་ཕྱིར་རྒལ་བ་དགྲ་བོར་གྱུར་པ་ཡིན་པས་བདག་ལ་གནོད་པ་བྱེད་པར་མི་འགྱུར་གྲང་།
en: “Sirs,” he said, “since Ajātaśatru, the king of Magadha, son of Vaidehī, has sought to do harm to you and been your enemy for many years, I am afraid he may do harm to me.”

source: དེ་དག་གིས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: They answered with this verse:

source: ཡུལ་འཁོར་གཞན་ཡང་འགྱེད་པར་ཡང་། །ཕོ་ཉ་མི་གསོད་ཅེས་གྲག་ན།
en: “Even at a time of war against another country, It is said that messengers are not killed. Needless to say, nobody will kill you,

source: །ཁྱོད་ནི་རྒྱལ་བའི་ཕོ་ཉ་ཡིན། །ཀུན་གྱིས་མི་གསོད་སྨོས་ཅི་དགོས།
en: Because you are a messenger to the Victor.”

source: །དེ་ནས་མདུན་ན་འདོན་མདའ་བོ་ཆེ་དགེ་མཚན་དང་བཀྲ་ཤིས་དང་བདེ་ལེགས་སུ་འགྱུར་བ་དག་བྱས་ཏེ། རིམ་གྱིས་རྒྱལ་པོའི་ཁབ་ཏུ་ཕྱིན་ནས་དེ་ལམ་གྱིས་དུབ་པ་བསལ་ཏེ།
en: Thereupon the chief priest Tomara performed various rituals that bring good fortune, blessings, and well-being, and in due course arrived in Rājagṛha.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: After he was fully rested, he went to the Blessed One.

source: བཅོམ་ལྡན་འདས་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་འགྱུར་བ་དང་། ཡང་དག་པར་མགུ་བར་འགྱུར་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་མདུན་ན་འདོན་མདའ་བོ་ཆེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When he arrived, face to face with the Blessed One, he made plenty of pleasant and joyful conversation, and then sat down to one side.

source: །ཀྱེ་གཽ་ཏ་མ་ཡངས་པ་ཅན་གྱི་ཚོགས་བཅོམ་ལྡན་འདས་གཽ་ཏ་མའི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་འམ། གནོད་པ་མ་མཆིས་སམ།
en: When he had sat down to one side, the chief priest Tomara said to the Blessed One, “O Gautama, the people of Vaiśālī bow low until their foreheads touch the Blessed One’s feet, and ask if the Blessed One is free from trouble, free from illness, in good physical condition, healthy, having no trouble, and living in vigor and comfort.” “Tomara, I hope you and the people of Vaiśālī are living in comfort, too.”

source: སྟོབས་དང་བདེ་བ་ལ་རེག་པར་སྤྱོད་དམ་ཞེས་སྙུན་གསོལ་ལགས་སོ། །མདའ་བོ་ཆེ་ཁྱོད་དང་ཡངས་པ་ཅན་གྱི་ཚོགས་བདེ་བར་གྱུར་ཅིག །ཀྱེ་གཽ་ཏ་མ་ཡངས་པ་ཅན་གྱི་ཚོགས་ཀྱི་མཆིད་ནས་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་དུ་གཤེགས་སུ་གསོལ།
en: “O Gautama, this is a message from the people of Vaiśālī: ‘May the Blessed One come to Vaiśālī.

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་དུ་མ་གཤེགས་ན་རིང་པོ་མི་ཐོགས་པ་ཁོ་ནར་ཡངས་པ་ཅན་སྟོངས་ཤིང་མིང་ཙམ་ལུས་པར་འགྱུར་རོ་ཞེས་མཆིའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: If the Blessed One does not come to Vaiśālī, Vaiśālī will soon be uninhabited, retaining only its name.’ ”

source: མདའ་བོ་ཆེ་འདིར་ང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཟླ་བ་གསུམ་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྟབས་པས་རྒྱལ་པོ་ལ་རྟོགས་ཤིག །གལ་ཏེ་རྒྱལ་པོས་གནང་ན་ང་དེ་བཞིན་དུ་གཤེགས་པར་བྱའོ།
en: “Tomara,” replied the Blessed One, “together with the community of disciples, I am being provided with all the requisites for three months by Ajātaśatru, the king of Magadha, son of Vaidehī. So, ask the king for permission. If the king permits it, I shall go as you have asked.”

source: །དེས་ཡངས་པ་ཅན་དུ་བཅོམ་ལྡན་འདས་ནི་འདི་སྐད་ཅེས་གསུང་ངོ་ཞེས་སྤྲིང་ངོ་།
en: Tomara sent a message to the people of Vaiśālī that the Blessed One had spoken thus. The people of Vaiśālī returned a message:

source: །དེ་རྣམས་ཀྱིས་ཀྱང་སྤྲིང་བ་དེ་ཉིད་ཀྱི་ཕྱིར་ཁྱོད་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་གང་ན་བ་དེར་སོང་ལ་སོན་ནས།
en: “Then you should go to Ajātaśatru, the king of Magadha, son of Vaidehī.

source: བདག་ཅག་གི་ཚིག་གིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། འཚོ་འམ། གནོད་པ་མ་མཆིས་སམ། སྟོབས་དང་བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་ཀྱང་དྲིས་ལ་འདི་སྐད་ཅེས།
en: When you arrive, ask on our behalf if Ajātaśatru, the king of Magadha, son of Vaidehī is free from trouble, free from illness, in good physical condition, healthy, having no trouble, and living in vigor and comfort. Then say this:

source: ལྷ་བཅོམ་ལྡན་འདས་ཡངས་པ་ཅན་དུ་གཤེགས་པར་བཅོམ་ལྡན་འདས་ལ་རྗེས་སུ་གནང་བར་མཛད་དུ་གསོལ།
en: ‘Your Majesty, please permit the Blessed One to come to Vaiśālī.

source: ལྷས་གལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་རྗེས་སུ་མ་གནང་ན་རིང་པོ་མི་ཐོགས་པ་ཁོ་ནར་ཡངས་པ་ཅན་སྟོངས་ཤིང་མིང་ལུས་པར་འགྱུར་རོ་ཞེས་སྨྲོས་ཤིག །དེ་ནས་མདུན་ན་འདོན་མདའ་བོ་ཆེས་བསམས་པ།
en: If Your Majesty does not permit it, Vaiśālī will soon be uninhabited, retaining only its name.’ ”

source: ཅི་རེ་ཞིག་རྒྱལ་པོ་ལ་བསྙེན་པར་བྱའམ། འོན་ཏེ་བློན་པོ་རྣམས་ལ་བྱ་སྙམ་དུ་བསམས་པ་དང་། དེ་འདི་སྙམ་དུ་སེམས་ཏེ། འགའ་ཞིག་གི་དངགས་ལས་བསྙེན་པར་མི་བྱ་སྟེ།
en: Then the chief priest Tomara asked himself, “Should I first contact the king, or his ministers?” He thought, “Some people say, ‘Do not make contact directly.

source: འོན་ཀྱང་བསྙེན་པ་བྱེད་པ་ལ་བསྙེན་པར་བྱའོ་ཞེས་འབྱུང་བས། མདོར་ན་བློན་པོ་རྣམས་ལ་བསྙེན་པར་བྱའོ་སྙམ་ནས།
en: You should contact those who help you contact the person.’ In short, I should contact the ministers.”

source: དེས་བློན་པོ་རྣམས་ལ་བསྙེན་པར་བྱ་བར་བརྩམས་སོ།
en: And so he did try to contact the ministers.

source: །དེ་ནས་བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། མདུན་ན་འདོན་དགོས་པ་ཅི་ཞིག་ལ་འོངས། དེས་སྨྲས་པ།
en: The ministers then inquired of him, “O Chief Priest, for what business have you come?”

source: ཤེས་ལྡན་དག་ཁོ་བོ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་ལྷ་ལ་གསོལ་བ་འདེབས་སུ་མཆིས་ཀྱིས་ཁྱེད་ཅག་གིས་གྲོགས་མཛོད་ཅིག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “Sirs,” he replied, “I came to ask His Majesty a favor for the Blessed One. Please help me.”

source: དེ་བཞིན་དུ་བྱས་ཁོ་བོ་ཅག་གིས་ཇི་ཙམ་ན་བོས་པ་དེའི་ཚེ་ཁྱོད་ཤོག་ཅིག །དེ་ནས་དེ་དག་གིས་སྐབས་ཤེས་ནས་བོས་པ་དང་དེ་ནས་མདུན་ན་འདོན་མདའ་བོ་ཆེ་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་གང་ན་བ་དེར་སོང་སྟེ་སོང་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་རྒྱལ་བ་དང་ཚེ་སྤེལ་བ་དག་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: “Certainly. Come when we call you,” they said. Thereupon they found an appropriate time and called him. The chief priest Tomara then went to Ajātaśatru, the king of Magadha, son of Vaidehī. When he arrived, he wished Ajātaśatru, the king of Magadha, son of Vaidehī, victory and long life and sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་མདུན་ན་འདོན་མདའ་བོ་ཆེས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་ཡངས་པ་ཅན་གྱི་ཚོགས་ཀྱི་མཆིད་ནས་ལྷ་ལ་གནོད་པ་ཆུང་ངམ། རེག་པར་གནས་སམ་ཞེས་བྱ་བ་རྒྱས་པར་སྙུན་གསོལ་ལོ།
en: When he had sat to one side, the chief priest Tomara said to Ajātaśatru, the king of Magadha, son of Vaidehī, “Your Majesty, the people of Vaiśālī ask whether Your Majesty is free from trouble . . . .”

source: །མདའ་བོ་ཆེ་ཁྱོད་དང་། ཡངས་པ་ཅན་གྱི་ཚོགས་བདེ་བར་གྱུར་ཅིག །ལྷ་ཡངས་པ་ཅན་གྱི་ཚོགས་ཀྱི་མཆིད་ནས་འདི་སྐད་ཅེས།
en: “Tomara, I hope you and the people of Vaiśālī are living in comfort, too.” “Your Majesty, this is a message from the people of Vaiśālī:

source: ལྷས་གལ་ཏེ་བཅོམ་ལྡན་འདས་ལ་རྗེས་སུ་མ་གནང་ན་རིང་པོ་མི་ཐོགས་པ་ཁོ་ནར་ཡངས་པ་ཅན་སྟོངས་ཤིང་མིང་ལུས་པར་འགྱུར་རོ་ཞེས་མཆིའོ།
en: If Your Majesty does not permit it, Vaiśālī will soon be uninhabited, retaining only its name.’”

source: །རྒྱལ་པོས་སྨྲས་པ། མདའ་བོ་ཆེ་ཁོ་བོས་ཡུན་རིང་མོ་ཞིག་ནས་ཀྱེ་མ་ཡངས་པ་ཅན་གྱི་གནས་སྟོངས་ཀྱང་ཅི་མ་རུང་སྙམ་དུ་བསམས་པ་དེ་གལ་ཏེ་ཡངས་པ་ཅན་གྱི་གནས་སྟོངས་པར་གྱུར་ན་ཁོ་བོ་ཡིད་ལ་བསམ་པ་ཚེགས་ཆུང་ངུས་རྫོགས་པར་མ་གྱུར་ཏམ།
en: “Tomara,” said the king, “I have long thought, ‘Oh, why shouldn’t the land of Vaiśālī become uninhabited?’ If the land of Vaiśālī becomes uninhabited, it will happen that I obtain without difficulty the very thing for which I have hoped.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། མདའ་བོ་ཆེ་སོང་ངོ་།
en: When the king had spoken thus, Tomara departed.

source: །བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་གཅིག་ཀྱང་ཡོངས་སུ་བཏང་བ་ལྟ་མཆིས་སམ།
en: The ministers said, “Your Majesty, does the Blessed One abandon any living being?”

source: ཤེས་ལྡན་དག་མེད་དོ།
en: “No, sirs, he does not.”

source: །དེ་ལྟ་ན་ལྷས་བཅོམ་ལྡན་འདས་ལ་བཀུར་སྟི་མ་ལགས་པ་བགྱིས་སོ།
en: “Then Your Majesty is performing a disrespectful act toward the Blessed One.

source: །ལྷས་བཅོམ་ལྡན་འདས་ལ་རྗེས་སུ་གནང་ཡང་རུང་། མ་གནང་ཡང་རུང་སྟེ། བཅོམ་ལྡན་འདས་ནི་ཡངས་པ་ཅན་གྱི་སེམས་ཅན་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་གཤེགས་པར་འགྱུར་བ་ཉིད་དོ། །རྒྱལ་པོས་སྨྲས་པ།
en: Whether Your Majesty permits the Blessed One or not, the Blessed One will go out of compassion for the beings in Vaiśālī.”

source: ཤེས་ལྡན་དག་ཁོ་བོས་མ་ཤེས་ཀྱིས་གལ་ཏེ་དེ་ལྟ་ན་ཁུག་ཤིག །དེ་དག་གིས་མདའ་བོ་ཆེ་བཀུག་ནས་རྒྱལ་པོས་སྨྲས་པ།
en: “Sirs, I did not know that,” said the king. “Call Tomara back, then.”

source: མདའ་བོ་ཆེ་ཁོ་བོས་དམ་བཅས་ཏེ་བཅོམ་ལྡན་འདས་རྗེས་སུ་གནང་བར་བྱའོ།
en: They called Tomara back and the king said to him, “Tomara, I promise I will permit the Blessed One to go.

source: །གལ་ཏེ་ཁོ་བོས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་བསྙེན་བཀུར་ཅི་འདྲ་བ་བྱས་པ་དེ་ཁོ་ན་འདྲ་བར་ཡངས་པ་ཅན་གྱི་ཚོགས་ཀྱིས་བྱ་ན། དེ་ལྟ་ན་ཁོ་བོས་རྗེས་སུ་གནང་ངོ་།
en: I will permit this if the people of Vaiśālī venerate and serve the Blessed One as I do.”

source: །དེས་ཡངས་པ་ཅན་རྣམས་ལ་རྒྱལ་པོ་འདི་སྐད་ཅེས་གསུང་ངོ་ཞེས་སྤྲིང་ངོ་།
en: Tomara then sent a message to the people of Vaiśālī: “The king has spoken thus.”

source: །དེ་རྣམས་ཀྱིས་སྨྲས་པ། རྒྱལ་པོ་མི་གཅིག་པུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་དང་བཀུར་སྟི་བྱེད་ན།
en: The people said, “While the king has venerated and served the Blessed One only by himself, why would we, who are many, not do so?” They sent a message back:

source: བདག་ཅག་ཚོགས་སུ་གྱུར་པས་ཅི་སྟེ་མི་བྱ་ཞེས་དེ་དག་གིས་བཅོམ་ལྡན་འདས་གཤེགས་སུ་གསོལ་ཅིག་དང་། བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལ་དེ་བས་ཀྱང་ཆེས་ཁྱད་པར་དུ་འཕགས་པའི་མཆོད་པ་དང་བཀུར་སྟི་བགྱིའོ་ཞེས་སྤྲིང་ངོ་། །དེ་ནས་མདའ་བོ་ཆེས་དོན་དེ་དག་རྒྱལ་པོ་ལ་རིག་པར་བྱས་སོ།
en: “Ask the Blessed One to come, and we will venerate and serve the Blessed One as a noble one more beautifully than the king did.” Tomara then informed the king of this.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ལ་བདག་ཇི་སྲིད་འཚོའི་བར་དུ་ན་བཟའ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གཟིམས་ཆ་དང་། སྙུན་དཔྱད་ཀྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བགྱིད་པར་སྤྲོ་ལགས་མོད་ཀྱི། བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་བས་གནང་བར་མི་འགྱུར་ལགས་ན།
en: When he had sat down to one side, Ajātaśatru, the king of Magadha, son of Vaidehī, said to the Blessed One, “Honored One, I wish to provide the Blessed One together with the community of monks with the requisites, namely, robes, almsfood, bedding and seats, and medicines for the sick, throughout my life, but the Blessed One will not permit it out of compassion for other beings.

source: བཅོམ་ལྡན་འདས་བདག་གི་གདུགས་ཚོད་གསོལ་བར་གནང་བར་མཛད་དུ་གསོལ།
en: May the Blessed One then assent to my offer of a meal.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to Ajātaśatru, the king of Magadha, son of Vaidehī, by remaining silent.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་སོང་ངོ་།
en: Ajātaśatru, the king of Magadha, son of Vaidehī, knowing that the Blessed One had assented by remaining silent, rose from his seat, bowed low until his forehead touched the Blessed One’s feet, and departed.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་དེ་ཉིད་ཀྱི་མཚན་མོ་ནས་ཞེས་བྱ་བ་ནས།
en: Thereupon Ajātaśatru, the king of Magadha, son of Vaidehī, prepared a pure and fine meal during the night. The next morning he let the Blessed One know the time by messenger: “Honored One, the time has arrived.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསོལ་ཟིན་ནས་ཕྱག་བཅབས་ཏེ་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: May the Blessed One know that the meal is ready.”

source: །གསེར་གྱི་བྱ་མ་བུམ་བླངས་ཏེ་བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་འདེབས་པ་ལ་ཞུགས་པ།
en: Knowing that the Blessed One had finished his meal and washed his hands and his bowl, the king held a golden pitcher and asked the Blessed One a favor:

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་གདུག་པ་དང་། གནོད་སྦྱིན་གདུག་པ་དེ་དང་དེ་རྣམས་ནི་བཏུལ་ལགས་ན།
en: “Honored One, the Blessed One has converted a lot of wicked nāgas and wicked yakṣas.

source: བཙུན་པ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་འདི་ཡུན་རིང་པོ་ཞིག་ནས་བདག་ཅག་ལ་ཤ་ཁོན་མ་མཆིས་པར་ནི་ཤ་ཁོན་བགྱིད། འགྲན་ཟླ་མ་མཆིས་པར་ནི་འགྲན་ཟླར་གྱུར། གནོད་པ་མ་མཆིས་པར་ནི་གནོད་པར་བགྱིད་པར་གྱུར་ཏེ། ལོ་ཏོག་གང་དག་སྐྱེས་ཤིང་སྐྱེས་པ་རྣམས་ཆུད་གཟོན་པར་བགྱིད་ལགས་ན།
en: Honored One, this nāga king Apalāla has, for a long time, been hostile toward us who are not hostile, adversarial toward us who are not adversarial, and injurious to us who have not been injurious, and he wasted our crops that had just grown.

source: བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་ལེགས་པར་གདུལ་བར་གསོལ།
en: May the Blessed One have compassion and excellently convert the nāga king Apalāla.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to Ajātaśatru, the king of Magadha, son of Vaidehī, by remaining silent.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་ཡོན་བསྔོ་བ་མཛད་ནས་གཤེགས་ཏེ།
en: Thereupon the Blessed One assigned the rewards of the offerings to Ajātaśatru, the king of Magadha, son of Vaidehī, and departed.

source: གཙུག་ལག་ཁང་དུ་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ཉིད་ལ་བཞུགས་སོ།
en: When he arrived at the monastery, the Blessed One sat on the seat prepared for him in front of the community of monks.

source: །བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་བྱང་ཕྱོགས་སུ་ཀླུའི་རྒྱལ་པོ་སོག་མ་མེད་འདུལ་དུ་འདོང་ངོ་།
en: When he had sat down, the Blessed One said to the venerable Ānanda, “Ānanda, let us go to convert the nāga king Apalāla in the northern region.

source: །བྱང་ཕྱོགས་ན་ནི་ཕན་ཡོན་ལྔ་ཡོད་དེ།
en: There are five advantages of the northern region.

source: མེ་ཏོག་ཕུན་སུམ་ཚོགས་པ་དང་། འབྲས་བུ་ཕུན་སུམ་ཚོགས་པ་དང་། ཆུ་ཕུན་སུམ་ཚོགས་པ་དང་། བསོད་སྙོམས་མོད་པ་དང་། སྐྱེ་བོའི་ཚོགས་དྲང་པོ་ཡོད་དོ་ཞེས་གསུངས་ནས་བཅོམ་ལྡན་འདས་ནང་དུ་ཡང་དག་འཇོག་གི་ཕྱིར་གཙུག་ལག་ཁང་དུ་ཞུགས་སོ།
en: There are abundant flowers; there are abundant fruits; there is abundant water; there is sufficient almsfood; and there are honest people.” When he had said this, the Blessed One entered the monastery to go into seclusion.

source: །དེ་ནས་ལུས་འཕགས་མའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་རྒྱལ་པོའི་ཁབ་ནས་ཆུ་བོ་གང་གཱའི་བར་གྱི་ལམ་དང་གྲོང་ཁྱེར་དག་ཆེ་ཐང་དུ་སྟོར་དུ་བཅུག་སྟེ་ལམ་རྡོ་བ་དང་། གསེག་མ་དང་། གྱོ་མོ་ཐམས་ཅད་བསལ་ནས་ཙན་དན་གྱི་ཆུས་ཆག་ཆག་བཏབ་དྲི་ཞིམ་པོ་སྣ་ཚོགས་ཀྱི་པོག་ཕོར་དག་བཤམས།
en: Thereupon Ajātaśatru, the king of Magadha, son of Vaidehī, ordered that the road from Rājagṛha to the Ganges and the cities in the country of Magadha all be cleaned: all the stones, pebbles, and gravel be removed; sandalwood water be sprinkled; sweet-smelling censers be set out;

source: དར་གྱི་ཆུན་འཕྱང་མང་པོ་དཔྱངས།
en: many silk tassels be hung;

source: བར་བར་དུ་མེ་ཏོག་གི་གཞལ་མེད་ཁང་དག་བྱས་སོ།
en: and at various intervals beautiful houses made of flowers be prepared.

source: །ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་ནི་ཆུ་བོ་གང་གཱ་ནས་ཡངས་པ་ཅན་གྱི་བར་དུ་དེ་བས་ལྷག་པར་ཁྱད་པར་དུ་འཕགས་པར་ལམ་དང་གྲོང་ཁྱེར་དག་སྟོར་དུ་བཅུག་གོ།
en: The people of the Licchavi clan in Vaiśālī had the road from the Ganges to Vaiśālī and the cities cleaned more beautifully than he did.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དགོངས་ཀ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ཏེ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ན་ལན་ད་གང་ན་བ་དེར་འདོང་ངོ་།
en: Then in the evening the Blessed One arose from his seclusion and said to the venerable Ānanda, “Ānanda, let us go to Nālandā.”

source: །བཙུན་པ་བཀའ་བཞིན་འཚལ་ཞེས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས།
en: “Certainly, O Honored One,” replied the venerable Ānanda to the Blessed One. II. Nālandā

source: དེ་ནས་བཅོམ་ལྡན་འདས་དང་ཡུལ་མ་ག་དྷཱའི་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་ན། ན་ལན་དར་བྱོན་ནས་ན་ལན་ད་ན་ཨ་མྲའི་ཚལ་དགག་དབྱེ་ཅན་ཞེས་བྱ་བ་ན་བཞུགས་སོ།
en: Thereupon the Blessed One, traveling through the country of Magadha, arrived in Nālandā, and stayed in a mango forest named Prāvārika near Nālandā.

source: །དེའི་ཚེ་ན་ལན་ད་ན་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་ཞེས་བྱ་བ་རྒས་པ། འཁོགས་པ། གཏུགས་པ་བཙས་ནས་ལོ་བརྒྱ་ཉི་ཤུ་ལོན་པ་ཞིག་གནས་པ་ལ། ན་ལན་དའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་བཀུར་སྟི་བྱེད། བླ་མར་བྱེད།
en: At that time, there lived a wandering mendicant named Reed Merchant, who was old, aged, elderly—a hundred and twenty years old.

source: རི་མོར་བྱེད། མཆོད་པར་བྱེད་དེ། དགྲ་བཅོམ་པར་བཀུར་རོ།
en: He was treated with honor, looked up to, esteemed, venerated, and paid homage to as a worthy man.

source: །དེ་ནས་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པའི་སྔོན་གྱི་གྲོགས་པོ་དང་། བློན་པོ་དང་། གཉེན་དང་། སྣག་གི་གཉེན་མཚམས་སུ་གྱུར་པའི་ལྷ་གང་ཡིན་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་བདག་གིས་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་ལ་འདི་སྐད་ཅེས། དྲང་སྲོང་ཁྱོད་ཚུར་ཤོག །བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་སྨྲས་ན། གང་ཡང་བདག་གི་ཚིག་མི་ཉན་པ་དེ་སྲིད་པས།
en: Now, a god who had once been a friend, companion, relative, and relation of the wandering mendicant Reed Merchant thought, “If I say to the wandering mendicant Reed Merchant, ‘O ṛṣi, lead now the pure life in the presence of the Blessed One,’ he will never listen to me.

source: མ་ལ་བདག་དེའི་དྲུང་དུ་སོང་སྟེ་ཡིད་ཀྱི་དྲི་བ་འཛིན་དུ་གཞུག་གོ་སྙམ་ནས།
en: Now I will go to him and make him ponder some questions.”

source: དེ་ནས་ལྷ་དེ་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The god then went to the wandering mendicant Reed Merchant.

source: ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he arrived, he said to the wandering mendicant Reed Merchant, “O ṛṣi, now accept and ponder these questions from me:

source: །དྲང་སྲོང་ཚུར་ཤོག །ཁོ་བོ་ལས་ཡིད་ཀྱི་དྲི་བ་ལོང་ལ་ཀུན་ཆུབ་པར་གྱིས་ཤིག །ཇི་ལྟར་མཛའ་བོ་མ་ཡིན་པ་ལ་མཛའ་བོ་ལྟར་བཅོས་པ་ཡིན་པར་བལྟ་བར་བྱ།
en: How should you recognize a person who pretends to be a friend while he is not in fact a friend?

source: ཇི་ལྟར་བདག་དང་འདྲ་བའི་མཛའ་བོ་ཡིན་པར་རིག་པར་བྱ། ཅིའི་ཕྱིར་སྤོང་།
en: How should you know a friend who loves you as much as himself? For the sake of what should you enter into renunciation?

source: ཇི་ལྟར་ནད་མེད་པ་འཐོབ།
en: How should you attain freedom from illness?

source: དྲང་སྲོང་གང་ཞིག་ཁྱོད་ཀྱི་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ་འདི་དག་ཚིག་གིས་ལུང་བསྟན་པས་སེམས་རངས་པར་བྱེད་པ་དེའི་ཐད་དུ་ཁྱོད་ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་སྨྲས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: O ṛṣi, hold these questions in your mind, and if someone answers them and thereby pleases you, you should lead the pure life in the presence of that person.” He then disappeared from there.

source: །དེ་ནས་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པས་ལྷ་དེ་ལས་ཡིད་ཀྱི་དྲི་བ་བཟུང་སྟེ་ཀུན་ཆུབ་པར་བྱས་ནས་འོད་སྲུང་རྫོགས་བྱེད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་འོད་སྲུང་རྫོགས་བྱེད་ཀྱི་དྲུང་དུ་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ།
en: Then the wandering mendicant Reed Merchant, having accepted and pondered the questions from the god, went to Pūraṇa Kāśyapa. When he arrived, he considered the questions in his mind in front of Pūraṇa Kāśyapa:

source: ཇི་ལྟར་མཛའ་བོ་མ་ཡིན་པ་ལ་མཛའ་བོ་ལྟར་བཅོས་པ་ཡིན་པར་བལྟ་བར་བྱ་ཞེས་བྱ་བ་ནས་ཇི་ལྟར་ནད་མེད་པ་འཐོབ་པར་འགྱུར་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་དེའི་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ་རྣམས་ཀྱང་མི་ཤེས་རྣམ་པར་མི་ཤེས་ན་ལན་གླན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “How should I recognize a person who pretends to be a friend while he is not in fact a friend? . . . . How should I attain freedom from illness?” Pūraṇa Kāśyapa did not know or understand the questions being considered in the mendicant’s mind, let alone answer them.

source: དེ་ནས་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་འདི་སྙམ་དུ་སེམས་ཏེ། འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་བདག་གི་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ་རྣམས་ཀྱང་མི་ཤེས་རྣམ་པར་མི་ཤེས་ན་ལན་གླན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་ནས།
en: Then the wandering mendicant Reed Merchant thought, “Pūraṇa Kāśyapa did not know or understand the questions considered in my mind, let alone answer them.”

source: དེ་ཀུན་དུ་རྒྱུ་གནག་ལྷས་ཀྱི་བུ་དང་། སྨྲ་འདོད་ཀྱི་བུ་མོའི་བུ་ཡང་དག་རྒྱལ་བ་ཅན་དང་། མི་ཕམ་སྐྲའི་ལ་བ་ཅན་དང་། ཀ་ཏྱའི་བུ་ནོག་ཅན་དང་། གཅེར་བུ་པ་གཉེན་གྱི་བུ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་གཅེར་བུ་པ་གཉེན་གྱི་བུའི་མདུན་དུ་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ།
en: He went to Maskarī Gośālīputra, Saṃjayī Vairaṭṭīputra, Ajita Keśakambala, and Nirgrantha Jñātiputra. When he arrived, he considered the questions in his mind in front of Nirgrantha Jñātiputra:

source: ཇི་ལྟར་མཛའ་བོ་མ་ཡིན་པ་ལ་མཛའ་བོ་ལྟར་བཅོས་པ་ཡིན་པར་བལྟ་བར་བྱ་ཞེས་བྱ་བ་ནས་གཅེར་བུ་པ་གཉེན་གྱི་བུའི་བར་གྱིས་ཀྱང་བདག་གི་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པ་རྣམས་ཀྱང་མི་ཤེས། རྣམ་པར་མི་ཤེས་ན་ལན་གླན་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་སྙམ་མོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “How should I recognize a person who pretends to be a friend while he is not in fact a friend?” . . . . He thought, “Nirgrantha Jñātiputra did not know or understand the questions considered in my mind, let alone answer them, either.”

source: །དེ་ནས་ཀུན་དུ་རྒྱུ་འདམ་བུའི་ཚོང་པ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ལ་ཡིད་ཀྱི་དྲི་བ་ཡིད་ཀྱིས་མངོན་པར་འདུས་བྱས་པའི་ཚིག་གིས་ལུང་བསྟན་པ་མི་ཐོབ་པ་དེ་འདྲ་བའི་རབ་ཏུ་བྱུང་བས་བདག་ལ་ཅི་ཞིག་བྱ།
en: Then the wandering mendicant Reed Merchant thought, “What is the use of my going forth under one who cannot answer the questions being considered in my mind?

source: བདག་གི་ཉེ་དུ་རྣམས་ལ་ལོངས་སྤྱོད་རྒྱ་ཆེར་ཡོད་པས། མ་ལ་བདག་འདུག་ལ་འདོད་པ་ཡང་ལོངས་སྤྱད་ཅིང་སྦྱིན་པ་ཡང་བཏང་། བསོད་ནམས་ཀྱང་བྱའོ་སྙམ་མོ། །ཡང་དེའི་བློ་སྐྱེས་པ།
en: Since my kinsmen have many possessions, I shall now stay at home, enjoy the objects of desire, give donations, and make merit.” Yet this idea also occurred to him:

source: མ་ལ་བདག་དགེ་སྦྱོང་གཽ་ཏ་མ་གང་ན་བ་དེར་འགྲོ་བར་བྱའོ་སྙམ་ནས་དེ་ཆས་པ་ན་ཡང་བསམས་པ།
en: “Now I shall go to the śramaṇa Gautama.”
